# SQLite3 Basics

Date: 2024/04/06

## SQLite操作練習

In [86]:
import pandas as pd

MEMBERS = {'name': ['John Lennon', 'Paul McCartney', 'Geroge Harrison', 'Ringo Starr'],
            'height': [179, 180, 178, 170]}
df = pd.DataFrame(MEMBERS)

df

              name  height
0      John Lennon     179
1   Paul McCartney     180
2  Geroge Harrison     178
3      Ringo Starr     170

In [87]:
import sqlite3

conn = sqlite3.connect('beatles.db')

In [88]:
cur = conn.cursor()

cur.execute('DROP TABLE "members"')
cur.execute('CREATE TABLE members(id INTEGER PRIMARY KEY AUTOINCREMENT, name STRING type UNIQUE, height NUMBER)')

In [89]:
# def insert_beatles(nameonly=True):

def insert_beatles(cursor, name_only=True):
    for idx in range(len(df)):
        row = df.iloc[idx]
        name = row['name']
        if name_only:
            cursor.execute(f'INSERT INTO members(name) values("{name}")')             
        else:
            height = row['height']
            cursor.execute(f'INSERT INTO members(name, height) values("{name}", {height})') 

insert_beatles(cur, name_only=True)

In [91]:
def dump(cursor):
    for record in cur.execute('SELECT * FROM members'):
        print(record)

dump(cur)

(1, 'John Lennon', None)
(2, 'Paul McCartney', None)
(3, 'Geroge Harrison', None)
(4, 'Ringo Starr', None)

In [93]:
def insert_height(cursor):
    for idx in range(len(df)):
        row = df.iloc[idx]
        name = row['name']
        height = row['height']
        cursor.execute(f'UPDATE members SET height={height} WHERE name="{name}"')             

insert_height(cur)

In [94]:
dump(cur)

(1, 'John Lennon', 179)
(2, 'Paul McCartney', 180)
(3, 'Geroge Harrison', 178)
(4, 'Ringo Starr', 170)

In [95]:
conn.commit()
conn.close()